var mapData = {
    center: [117.380621,36.677093], // 初始地图中心位置
    points: [
        //以下是教学楼
        {name: '明德楼', long: 117.37828, lat: 36.678236, note: '楼号B1，主要供教学、自习使用。'},
        {name: '闻道楼', long: 117.378235, lat: 36.676846, note: '楼号B3，图书馆、报刊阅览室所在地。'},
        {name: '逸夫楼', long: 117.381608, lat: 36.676333, note: '机房、电子阅览室所在地，可以在此处开通宿舍有线网。'},
        {name: '弘毅楼', long: 117.38177, lat: 36.677708, note: '楼号B2，主要供教学、自习使用。'},
        {name: '敏行楼', long: 117.3815, lat: 36.673684, note: '楼号B5，主要供教学、自习使用。'},
        //以下是宿舍楼
        {name: '四号学生公寓', long: 117.379322, lat: 36.674227, note: '楼号C4。'},
        {name: '五号学生公寓', long: 117.379196, lat: 36.673105, note: '楼号C5。'},
        {name: '一号学生公寓', long: 117.38313, lat: 36.678518, note: '楼号C1。'},
        {name: '二号学生公寓', long: 117.382466,lat: 36.67765, note: '楼号C2。在此缴纳宿舍电费。'},
        {name: '三号学生公寓', long: 117.383211, lat: 36.676738, note: '三号学生公寓，楼号C3。'},
        //以下为服务机构
        {name: '第一食堂', long: 117.382996, lat: 36.676063, note: '两层。'},
        {name: '第二食堂', long: 117.381747, lat: 36.672859, note: '两层。一层有乐而美、鸡公煲，二层是乒乓球室。'},
        {name: '大学生乐购超市', long: 117.378624, lat: 36.674205, note: '四号学生公寓对过。'},
        {name: '学苑超市', long: 117.382888, lat: 36.676264, note: '第一食堂附近。'},
        {name: '学生浴室', long: 117.382996, lat: 36.676434, note: '学苑超市后方。'},
        {name: '东门商业街', long: 117.383741, lat: 36.673717, note: '小吃、餐馆、台球室、理发馆等聚集地。'}
    ]
};