var mapData = {
    center: [117.029522, 36.63185], // 初始地图中心位置
    points: [
        {name: '六号教学楼', long: 117.029047, lat: 36.631332, note: '最诡异的教学楼'},
        {name: '校医院', long: 117.029248, lat: 36.633215, note: ''},
        {name: '北门', long: 117.028605, lat: 36.633454, note: '很多快递师傅都在这里'},
        {name: '实验楼', long: 117.02774, lat: 36.63286, note: '实验、计算机、听力课'},
        {name: '六号楼', long: 117.029047, lat: 36.631332, note: '教学楼，内部结构比较诡异，第一次来上课请提前半小时'},
        {name: '一号楼', long: 117.029239, lat: 36.631825, note: '教学楼'},
        {name: '二号楼', long: 117.029419, lat: 36.632317, note: '教学楼'},
        {name: '三号楼', long: 117.029562, lat: 36.632751, note: '教学楼'},
        {name: '四号楼', long: 117.026966, lat: 36.631332, note: ''},
        {name: '西门', long: 117.026513, lat: 36.631267, note: '正对舜玉路'},
        {name: '小西门', long: 117.027209, lat: 36.632201, note: '直达公交站'},
        {name: '干训楼', long: 117.026644, lat: 36.629652, note: ''},
        {name: '游泳馆', long: 117.027236, lat: 36.628986, note: '5-10月，下午4-8点开放'},
        {name: '五号楼', long: 117.028162, lat: 36.630869, note: ''},
        {name: '五号楼', long: 117.028162, lat: 36.630869, note: ''},
        {name: '体育场', long: 117.031098, lat: 36.632469, note: ''},
        {name: '12号楼', long: 117.032394, lat: 36.63215, note: '宿舍楼'},
        {name: '21号楼', long: 117.032367, lat: 36.631991, note: '宿舍楼'},
        {name: '国际交流中心', long: 117.025227, lat: 36.627516, note: '天舜大厦'}
    ]
};