var mapData = {
    center: [117.079712, 36.650804], // 初始地图中心位置
    points: [
        //以下是教学楼
        {name: '一号教学楼', long: 117.076849, lat: 36.649851, note: '主要供老师办公和学生学习，主要是艺术学院的专业课学习,有农行ATM机'},
        {name: '二号教学楼', long: 117.076839, lat: 36.649511, note: '主要供学生上课和自习'},
        {name: '三号教学楼', long: 117.077447, lat: 36.649518, note: '实验楼，进行计算机、英语听力等上机实验，四楼开网线'} ,
        {name: '四号教学楼', long: 117.077705, lat: 36.650814, note: '老师办公的地方也是一些社团和学生会所在地'},
        {name: '逸夫楼', long: 117.081184, lat: 36.649598, note: '在图书馆旁边，供学生上课，自习等'},
        {name: '图书馆', long: 177.081768, lat: 36.649612, note: '供学生借书和自习'},
        {name: '山东财经大学燕山校区幼儿园', long: 117.078213, lat: 36.651559, note: ''},
        {name: '山东财经大学老教育工作者协会', long: 177.077422, lat: 36.651548, note: ''},

//以下是宿舍楼
        {name: '一号宿舍楼', long: 117.079636, lat: 36.649481, note: '男宿，八人'},
        {name: '二号宿舍楼', long: 117.079605, lat: 36.649572, note: '女宿，八人'},
        {name: '三号宿舍楼', long: 117.079897, lat: 36.6498, note: '女宿，八人，无阳台'},
        {name: '四号宿舍楼', long: 117.078963, lat: 36.649308, note: '女宿，八人'},
        {name: '五号宿舍楼', long: 117.078949, lat: 36.649811, note: '女宿，八人，独立卫浴'},

//{name:'六号宿舍楼',long:note:''},
//{name:'七号宿舍楼',long:note:''},

        {name: '八号宿舍楼', long: 117.083252, lat: 36.649869, note: '男宿'},
        {name: '九号宿舍楼', long: 117.083243, lat: 36.649727, note: '男宿，八人，无阳台'},

//{name:'十号宿舍楼',long:note:''},
//{name:'十一号宿舍楼',long:note:''},

//以下是食堂
        {name: '西苑食堂', long: 117.078971, lat: 36.649619, note: '四号宿舍楼下，五号宿舍对面,东侧打水'},
        {name: '东苑餐厅', long: 117.082129, lat: 36.650806, note: '运动场旁，9号宿舍楼附近，东侧打水'},
        {name: '南苑食堂', long: 117.07766, lat: 36.651805, note: '民族食堂，可打水'},

//以下是娱乐场所
        {name: '运动场', long: 117.080861, lat: 36.650894, note: '大部分体育课上课的地方'},
        {name: '财大书店', long: 117.081454, lat: 36.65013, note: '各种书籍，圆通快递'},
        {name: '韵达快递', long: 117.081121, lat: 36.649591, note: '逸夫楼西侧'},
        {name: '申通快递', long: 117.08065, lat: 36.650394, note: '逸夫楼对面'},
        {name: '乒乓球培训中心', long: 117.080717, lat: 36.650405, note: ''},
        {name: '台球室', long: 117.0806, lat: 36.650416, note: '12点后营业'},
        {name: '中国联通营业厅', long: 117.081197, lat: 36.650115, note: ''},
        {name: '中国移动营业厅', long: 117.081238, lat: 36.650347, note: ''},
        {name: '建行、招商银行RTM机', long: 117.081341, lat: 36.650108, note: '只取不存'},
        {name: '打印社', long: 117.082496, lat: 36.649598, note: '可以拍一寸照片，缩印，打印等'},
        {name: '茶巷工', long: 117.082388, lat: 36.649627, note: '奶茶店'}
    ]
};